# n = input()
#
# summ = 0
#
#
# if n[0] == n[2]:
#     for i in range(0, 10):
#         if i != n[1]:
#             m = n[0] + str(i) + n[2]
#             summ += int(m)
# elif n[2] == 0:
#     m = n[0] + n[1] + n[0]
#     summ += int(m)
# else:
#     m = n[0] + n[1] + n[0]
#     k = n[2] + n[1] + n[2]
#     summ += int(m)
# print(summ)

# n = int(input())
# a = list(map(int,input().split()))
# b = list( map(int,input().split()))
# ans = 0
# for i in range(1,n):
#     for j in range(i+1,n):
#         f = (a[i]*b[j])+(a[j]*b[i])
#         print(i,j, f)
#         if ans < f :
#             ans = f
# print(ans)
#

# Перевод римьских чисел в звичайні і навпаки

# Римські цифри представлені сімома різними символами: I, V, X, L, C, D та M.
#
# Символ       Значення
# I             1
# V             5
# X             10
# L             50
# C             100
# D             500
# M             1000
# Наприклад, 2 пишеться як II у римських цифрах, просто два одиничні додані разом. 12 пишеться як XII, що просто X + II.
# Число 27 пишеться як XXVII, що є XX + VI + I.
#
# Римські цифри зазвичай пишуться від найбільшої до найменшої зліва направо.
# Однак, число чотири не пишеться як IIII. Замість цього, число чотири пишеться як IV.
# Оскільки одиниця стоїть перед п'ятіркою, ми віднімаємо її, утворюючи чотири.
# Те ж саме стосується числа дев'ять, яке пишеться як IX. Існує шість випадків, коли використовується віднімання:
#
# I можна поставити перед V (5) та X (10), щоб отримати 4 і 9.
# X можна поставити перед L (50) та C (100), щоб отримати 40 і 90.
# C можна поставити перед D (500) та M (1000), щоб отримати 400 і 900.
# Задача: перетворити римське число на ціле число.

dct = {1:"I",
       5:"V",
       10:"X",
       50:"V",
       100:"C",
       500:"D",
       1000:"M",

       4: "IV",
       9: "IX",
       40:"XL",
       90:"XC",
       400:"CD",
       900:"CM"
       }
n = int(input("Enter a number: "))
ans = ""
for z in [1000,900,500,400,100,90,40,10,9,5,4,1]:
    while n >= z:
        n -= z
        ans += dct[z]
print(ans)