# ----------------------------------------
#У Петрика є два числа a та b (a≤b).
# Він знайшов середнє арифметичне цих чисел (нехай, це буде число c), яке виявилось теж цілим.
# Тобто, c= (a+b)/2
# Вам дано число a (тобто менше з тих двох чисел), а також дано число c. Знайдіть b.

# Приклади
# Вхідні дані #1
# 37
# Відповідь #1
# 11

# b = int(input("Ведіть b - "))
# c = int(input("Ведіть c - "))
#
# a = (2*c-b)
# print(a)

#----------------------------------------

# https://uoi.eolymp.space/uk/problems/3

# Сьогодні Петрик нарешті написав екзамен з математичного аналізу. Всього на екзамені було a легких задач та b складних,
# при цьому кожна складна задача важила вдвічі більше балів ніж проста.
# Петрик пам'ятає, що не зміг розв'язати рівно x легких та рівно y складних задач, а всі інші задачі він точно розв'язав
# правильно.
# Тепер же Петрик цікавиться, чи радіти йому успішній здачі екзамену, якщо для складання екзамену треба набрати хоча б 51%
# від максимальної кількості балів.
# Зверніть увагу, що, якщо Петрик отримає 50.5% балів, то екзамен вважається не зданим.

# Вхідні дані
# Перший рядок містить чотири цілі числа a,b,x та y (1≤x≤a≤10^5, 1≤y≤b≤10^5).

# Вихідні дані
# У випадку якщо Петрик склав екзамен виведіть «YES», інакше «NO». Букви можна виводити у будь-якому регістрі.

# Приклади

# Вхідні дані #1
# 10 3 10 3
# Відповідь #1
# NO

# Вхідні дані #2
# 12 4 3 2
# Відповідь #2
# YES

# a = int(input("Ведіть кількість легких задач - "))
# b = int(input("Ведіть кількість важких задач - "))
# x = int(input("Ведіть кількість неправильних легких задач - "))
# y = int(input("Ведіть кількість неправильних важких задач - "))
# data = input().split()
# for i in range(len(data)):
#     data[i] = int(data[i])
# a, b, x, y = data
#
# all_points = a+b*2
#
# correct_ans = (a-x + 2*(b-y))
#
#
# if all_points*0.51 <= correct_ans:
#     print("Yes")
# else:
#     print("No")


# ----------------------------------------

# Журі олімпіади пропонує вам розв'язати нескладну головоломку.
# Ми загадуємо два цілих числа, які тримаємо в таємниці, натомість повідомляємо вам два інших цілих числа A та B.
# Якщо перше наше невідоме число зменшити на A, а друге невідоме число збільшити на B, то невідомі числа стануть рівними.
# Якщо ж навпаки, перше невідоме число збільшити на A, а друге невідоме число зменшити на B, то перше невідоме число стане вдвічі більшим за друге.
# Напишіть програму, яка за числами A та B відгадає числа, які журі тримає в таємниці.

# Вхідні дані
# У першому рядку вхідних даних записано ціле число A, а у другому − ціле число B. Гарантується, що
# −10^9 ≤A≤ 10^9  та  −10^9 ≤B≤ 10^9

# Вихідні дані
# У перший рядок виведіть перше невідоме число, яке журі тримає в таємниці, а другий рядок − друге.

# Приклади

# Вхідні дані #1 - 1 1
# Відповідь #1 - 7 5

# Вхідні дані #2 - 1 2
# Відповідь #2 - 11 8

#qdsd

data = input().split()

for i in range(len(data)):
    data[i] = int(data[i])

A, B = data

y = 3*B + 2*A
x = y + A + B

print(f"x = {x}, y = {y} ")