# -----------------------------------------------------------
# https://uoi.eolymp.space/problems/64
# Яблука
#
# У Козака Вуса є нескінченна кількість зелених, жовтих та червоних яблук.
# Він буде їх виставляти в один ряд за наступним алгоритмом:
# Спочатку g зелених яблук, потім y жовтих, потім r червоних, потім y жовтих, потім g зелених, а потім все знову
# нескінченну кількість разів. Наприклад, якщо g=1, y=3, r=4, то перші яблука виглядатимуть так:
# GYYYRRRRYYYGGYYYRRRRYYYGGYYYRRR...
# Тобто, всі яблука можна розбити на блоки. На цьому малюнку один блок це GYYYRRRRYYYG. Зверніть увагу, що блок
# починається і закінчується на один й той же символ. Саме тому на першому малюнку йдуть дві G підряд попри те, що g=1.
# Знайдіть колір яблука, що знаходиться на n-ій позиції.
#
# Вхідні дані
# Перший рядок містить чотири цілі числа n, g, y, r (1≤n,g,y,r≤10**12).
# Зверніть увагу, що числа не вміщаються у 32-бітні цілочисельні типи даних. Тому потрібно використовувати 64-бітні
# цілочисельні типи даних, такі як long long в C++, long в Java чи int64 в Pascal.
#
# Вихідні дані
# Якщо колір буде зелений, то виведіть «G».
# Якщо колір буде жовтий, то виведіть «Y».
# Якщо колір буде червоний, то виведіть «R».

# Приклад 1
# Вхідні дані
# 1 1 3 4
# Вихідні дані
# G

# Приклад 2
# Вхідні дані
# 12 1 3 4
# Вихідні дані
# G

# Приклад 3
# Вхідні дані
# 1000000000000 1 3 4
# Вихідні дані
# Y

# n,g,y,r = map(int,input().split())
#
# lin = "G"*g+"Y"*y+"R"*r+"Y"*y+"G"*g
#
#
# pre_uns = n%len(lin)
#
# print(lin[pre_uns])



#========================


#https://uoi.eolymp.space/problems/71
# Кінь
#
# Python
# Дано шахова дошка розміром 8×8. На цій дошці є лише одна фігура — кінь. Знайдіть кількість клітин, на яку кінь може
# переміститися за один хід.
# Нагадаємо, що кінь рухається буквою "Г". Формально, кінь може переміститися з клітини з координатами (x1,y1) у клітину
#  (x2,y2), якщо ∣x1−x2∣=1 та ∣y1−y2∣=2, або ж ∣x1−x2∣=2 та ∣y1−y2∣=1.
#
# Вхідні дані
# Перший рядок містить два символи. Перший символ — англійська буква від a до h у нижньому регістрі. Другий символ —
# цифра від 1 до 8.
#
# Вихідні дані
# Виведіть одне ціле число.
#
# Приклади
#
# Приклад 1
# Вхідні дані
# d4
# Вихідні дані
# 8
#
# Приклад 2
# Вхідні дані
# h1
# Вихідні дані
# 2


klt = input()
dct = {"a":1,"b":2,"c":3,"d":4,"e":5,"f":6,"g":7,"h":8}
x = dct[klt[0]]
y = int(klt[1])
counter = 0

moves = [[-2,-1],[-1,-2],[1,-2],[2,-1],[-2,1],[-1,2],[1,2],[2,1]]
for move in moves:
    dx=x + move[0]
    dy=y+move[1]
    if 1<= dx <= 8 and 1<= dy <= 8:
        counter+=1
print(counter)