#-----------------------------------------
#https://uoi.eolymp.space/uk/problems/27
#
#Тестування
# Антончик вирішив пройти тестування. На вхід у тесті задається послідовність цілих чисел, а Антончику необхідно знайти
# зайве — число, яке відрізняється від всіх інших по парності. Допоможіть геройчику: знайдіть позицію числа з
# послідовності яке є зайвим.
#
# Вхідні дані
# Перший рядок містить одне ціле число n (3≤n≤10**5) — довжина послідовності.
#
# Другий рядок містить n цілих чисел a1, a2, a3, ... an (1<=a<=10**5)— елементи послідовності.
# Гарантується, що рівно одне з чисел є зайвим.
#
# Вихідні дані
# Виведіть одне ціле число — позицію зайвого числа у послідовності. Числа послідовності нумеруються від 1 до n.
#
# Приклад
#
# Вхідні дані #1
# 5
# 2 4 7 8 10
# Відповідь #1
# 3
#
# Вхідні дані #2
# 4
# 1 2 1 1
# Відповідь #2
# 2
# n = int(input())
# m = list(map(int,input().split()))
# c = []
# c2 = []
#
# for i in m:
#     if i%2 == 0:
#         c.append(i)
#     else:
#         c2.append(i)
#
# if len(c) == 1:
#     print(m.index(c[0]))
# else:
#     print(m.index(c2[0]))

#======================================================================================


# Дано непорожній масив цілих чисел nums, де кожен елемент з'являється двічі, за винятком одного. Знайдіть це єдине число.
# Ви повинні реалізувати розв'язок з лінійною складністю часу та використовувати тільки константний додатковий простір.
#
# Example 1:
# Input: nums = [2,2,1]
# Output: 1
#
# Example 2:
# Input: nums = [4,1,2,1,2]
# Output: 4
#
# Example 3:
# Input: nums = [1]
# Output: 1

# nums = list(map(int,input().split()))
# for i in nums:
#     if nums.count(i) == 1:
#         print(i)

# ------------------------------------------------
# https://uoi.eolymp.space/uk/problems/31
# Козак Вус у ДеревляндіїКозак Вус у Деревляндії
#
# Нещодавно Козака Вуса обрали президентом Деревляндії, і перш за все він оцінив ситуацію з транспортом. У країні є n міст,
# між якими вже прокладена мережа з n−1 дороги таким чином, що з будь-якого міста можна доїхати до будь-якого іншого,
# пересуваючись тільки вже збудованими дорогами.
#
# Козак Вус вирішив провести транспортну реформу, в результаті якої послідовні дороги будуть об'єднані в траси. Для цього
# йому необхідно визначити одне з n міст як столицю Деревляндії, після чого створити як можна менше трас таким чином, щоб
# зі столиці можна було добратись до будь-якого іншого міста, пересуваючись трасою. Трасою називається послідовність
# унікальних міст, що починається в столиці, і кожне з міст з'єднане зі своїми сусідами. Більш формально, це
# послідовність з k міст a1, a2, a3...ak така, що a1 є столицею, для будь-якого i (1<=i<=k) міста a(i) та a(i+1) зв'язані
# між собою дорогою, і всі елементи послідовності різні.)
#
# Козак Вус зараз зайнятий більш важливими справами, а тому просить вас допомогти йому обрати столицю таким чином, щоб
# необхідна кількість трас, яку потрібно створити, була мінімальною, а також порахувати цю кількість.
#
# Зверніть увагу, що одна дорога може належати до декількох різних трас.
#
# Вхідні дані
# Перший рядок містить одне ціле число n (2≤n≤2⋅10**5) — кількість міст у Деревляндії.
# Кожен з наступних n−1 рядків містить два цілих числа u і v (1≤u,v≤n) — номери двох міст, між якими є дорога.
#
# Вихідні дані
# У першому рядку виведіть номер міста, яке Козак Вус зробить столицею. Якщо існує декілька відповідей, виведіть серед
# них найменшу.
# У другому рядку виведіть кількість трас, яку потрібно створити так, щоб виконувалась необхідна умова.
#
# Приклад
# Вхідні дані #1
# 5
# 2 3
# 1 2
# 1 4
# 5 1
# Відповідь #1
# 3
# 2
#
# Вхідні дані #2
# 7
# 6 1
# 7 3
# 2 1
# 3 1
# 4 1
# 1 5
# Відповідь #2
# 2
# 4

#Фішка в тому, що траси будуть починатись і закінчуватись в тупіках (тобто в містах з 1 коннектом). тому кількість трас
# буде на 1 меньше за к-сть тупікових міст. А столицею буде тупікове місто з найменьшим номером

# l = [6,1,7,3,2,1,3,1,4,1,1,5]
# # cc = 111111111111111111111111
# # for i in l:
# #     if l.count(i) == 1:
# #         if cc > i:
# #             cc = i
# #             print(cc)
# # print(cc)

# n = int(input())
# m = []
# fcc = []num_map = {
#     "I": 1,  # однобуквені
#     "V": 5,
#     "X": 10,
#     "L": 50,
#     "C": 100,
#     "D": 500,
#     "M": 1000,
#
#     "IV": 4,  # двобуквені
#     "IX": 9,
#     "XL": 40,
#     "XC": 90,
#     "CD": 400,
#     "CM": 900
#
# }
# t_counter = 0
# for _ in range(1,n):
#     u,v = map(int,input().split())
#     m.append(u)
#     m.append(v)
# for i in m:
#     if m.count(i) == 1:
#         fcc.append(i)
#
# print(min(fcc))
# print(len(fcc)-1)

#=============================

num_map = {
    "I": 1,  # однобуквені
    "V": 5,
    "X": 10,
    "L": 50,
    "C": 100,
    "D": 500,
    "M": 1000,

    "IV": 4,  # двобуквені
    "IX": 9,
    "XL": 40,
    "XC": 90,
    "CD": 400,
    "CM": 900

}

n = input()
