# https://uoi.eolymp.space/problems/62
# Кава
#
# Андрій вирішив випити кави в одній Київській кав'ярні. Проте він згадав, що у Києві "червона зона".
# Нагадаємо, що у "червоній зоні" у Києві лише повністю вакциновані люди (тобто ті, які отримали два щеплення) можуть
# відвідувати кав'ярні. Якщо ж людина неповнолітня (строго менше ніж 18 років), то вона може відвідати кав'ярню лише з
# повністю вакцинованим дорослим, при цьому дитина не зобов'язана бути вакцинованою.
# Андрію n років та він отримав m щеплень. А його повнолітній батько, Борис, отримав уже k щеплень.
# Визначте, чи зможе Андрій потрапити у кав('ярню. Можливо, разом з батьком.Андрій вирішив випити кави в одній Київській '
# кав')ярні. Проте він згадав, що у Києві "червона зона".
# Нагадаємо, що у "червоній зоні" у Києві лише повністю вакциновані люди (тобто ті, які отримали два щеплення) можуть
# відвідувати кав'ярні. Якщо ж людина неповнолітня (строго менше ніж 18 років), то вона може відвідати кав'ярню лише з
# повністю вакцинованим дорослим, при цьому дитина не зобов'язана бути вакцинованою.
# Андрію n років та він отримав m щеплень. А його повнолітній батько, Борис, отримав уже k щеплень.
# Визначте, чи зможе Андрій потрапити у кав'ярню. Можливо, разом з батьком.
#
# Вхідні дані
# Перший рядок містить одне ціле числа n (12≤n≤30) — вік Андрія.
# Другий рядок містить два цілі числа m та k (0≤m,k≤2) — кількість щеплень, які отримали Андрій та Борис відповідно.
#
# Вихідні дані
# Виведіть «Yes», якщо Андрій зможе потрапити у кав'ярню, або «No» — інакше.
# Ви можете виводити букви у будь-якому регістрі.
from Olympics.lesson6 import grid

# Приклад 1
# Вхідні дані
# 15
# 1 2
# Вихідні дані
# YES
#
# Приклад 2
# Вхідні дані
# 29
# 1 2
# Вихідні дані
# NO

# n = int(input())
# m,k = map(int,input().split())
#
# if n < 18:
#     if k >= 2:
#         print("Yes")
#     else:
#         print("No")
#
# else:
#     if m >= 2:
#         print("Yes")
#     else:
#         print("No")


#==========================================================




# https://uoi.eolymp.space/problems/63
# Коробка
#
# У Козака Вуса є коробка, яка може вмістити до k кілограмів включно. Якщо у коробці будуть речі, вага яких перевищує k
# кілограмів, то вона порветься. У нього також є п'ять м'ячів вагою a1,a2,a3,a4,a5 кілограмів відповідно. Також відомо,
# що вага кожного наступного м'яча більша за попередню.
# Визначте максимальну кількість м'ячів, які можна положити у коробку так, що вона не порвалася.
#
# Вхідні дані
# Перший рядок містить одне ціле число k (1≤k≤100).
# Другий рядок містить п('ять цілих чисел a1,a2,a3,a4,a5 (1≤a≤25). Гарантується, що кожне наступне число більше за '
# попереднє.)
#
# Вихідні дані

# Приклад 1
# Вхідні дані
# 10
# 1 4 5 7 25
# Вихідні дані
# 3

# Приклад 2
# Вхідні дані
# 4
# 1 2 3 4 5
# Вихідні дані
# 2

# Приклад 3
# Вхідні дані
# 9
# 1 2 3 4 5
# Вихідні дані
# 3

# k = int(input())
# a = list(map(int,input().split()))
# res = 0
# c = 0
#
# for i in a:
#     c += i
#     print(c)
#     if c <= k:
#         res+=1
# print(res)


#================================================


# Дано ціле число numRows, поверніть всі послідовності з трикутника Паскаля.
# У трикутнику Паскаля кожне число є сумою двох чисел безпосередньо над ним, як показано:
# https://drive.google.com/file/d/1d9SP8Zhqrfr6LXGH3QMv74zpzAvaIXIN/view?usp=sharing
# https://drive.google.com/file/d/1V-rZvk3_yiiQeRr3Nypkp9QewpzJz5E5/view?usp=sharing
# https://drive.google.com/file/d/1ppa478oX_Uz6E9oCCyR28MuKmfYpgB0u/view?usp=sharing

 # Example 1:
 # Input: numRows = 5
 # Output: [[1],[1,1],[1,2,1],[1,3,3,1],[1,4,6,4,1]]
 #
 # Example 2:
 # Input: numRows = 1
 # Output: [[1]]

numRows = int(input())
answer = []

for i in range(numRows):
    grid = []
    for j in range(i+1):
        if j == 0 or j == i:
            grid.append(1)
            continue
        x = answer[i-1][j-1] + answer[i-1][j]
        grid.append(x)
    answer.append(grid)


probily = numRows -1

for grid in answer:
    print(" "* probily, end = "")

    probily -= 1

    for el in grid:
        print(el, end=" ")

    print()